Revit 2027 API
BuiltInFailures.ScaleFailures Class
 Failures about Scale.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ScaleFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ScaleFailures
Public NotInheritable Class ScaleFailures
public ref class ScaleFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ScaleFailures = class end
The BuiltInFailures.ScaleFailures type exposes the following members.
Properties
Name | Description
CannotScaleLinkWithSharedCoordinates |  Can't scale link that shares coordinates with host model
Top
See Also
Reference
Autodesk.Revit.DB Namespace